Terraform Plan:

```
[command]/home/runner/work/_temp/ac1a05c5-b741-433e-8c6f-3227c2350e70/terraform-bin plan -no-color -out=tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster-1.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "us-central1-c"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "cluster-1"
      + network                     = "default"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "istiosetup"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + workload_identity_config {
          + workload_pool = "istiosetup.svc.id.goog"
        }
    }

  # module.cluster-1-node-pool.google_container_node_pool.primary_preemptible_nodes will be created
  + resource "google_container_node_pool" "primary_preemptible_nodes" {
      + cluster                     = "cluster-1"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1-c"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "cluster-1-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n1-standard-2"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "k8s-sa@istiosetup.iam.gserviceaccount.com"
          + spot              = false
          + taint             = (known after apply)
        }
    }

  # module.cluster-2.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "us-east1-b"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "cluster-2"
      + network                     = "default"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "istiosetup"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + workload_identity_config {
          + workload_pool = "istiosetup.svc.id.goog"
        }
    }

  # module.cluster-2-node-pool.google_container_node_pool.primary_preemptible_nodes will be created
  + resource "google_container_node_pool" "primary_preemptible_nodes" {
      + cluster                     = "cluster-2"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1-b"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "cluster-2-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n1-standard-2"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "k8s-sa@istiosetup.iam.gserviceaccount.com"
          + spot              = false
          + taint             = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.cluster-1.google_container_cluster.primary will be created%0A  + resource "google_container_cluster" "primary" {%0A      + cluster_ipv4_cidr           = (known after apply)%0A      + datapath_provider           = (known after apply)%0A      + default_max_pods_per_node   = (known after apply)%0A      + enable_binary_authorization = false%0A      + enable_intranode_visibility = (known after apply)%0A      + enable_kubernetes_alpha     = false%0A      + enable_l4_ilb_subsetting    = false%0A      + enable_legacy_abac          = false%0A      + enable_shielded_nodes       = true%0A      + endpoint                    = (known after apply)%0A      + id                          = (known after apply)%0A      + initial_node_count          = 1%0A      + label_fingerprint           = (known after apply)%0A      + location                    = "us-central1-c"%0A      + logging_service             = (known after apply)%0A      + master_version              = (known after apply)%0A      + monitoring_service          = (known after apply)%0A      + name                        = "cluster-1"%0A      + network                     = "default"%0A      + networking_mode             = (known after apply)%0A      + node_locations              = (known after apply)%0A      + node_version                = (known after apply)%0A      + operation                   = (known after apply)%0A      + private_ipv6_google_access  = (known after apply)%0A      + project                     = "istiosetup"%0A      + remove_default_node_pool    = true%0A      + self_link                   = (known after apply)%0A      + services_ipv4_cidr          = (known after apply)%0A      + subnetwork                  = (known after apply)%0A      + tpu_ipv4_cidr_block         = (known after apply)%0A%0A      + workload_identity_config {%0A          + workload_pool = "istiosetup.svc.id.goog"%0A        }%0A    }%0A%0A  # module.cluster-1-node-pool.google_container_node_pool.primary_preemptible_nodes will be created%0A  + resource "google_container_node_pool" "primary_preemptible_nodes" {%0A      + cluster                     = "cluster-1"%0A      + id                          = (known after apply)%0A      + initial_node_count          = (known after apply)%0A      + instance_group_urls         = (known after apply)%0A      + location                    = "us-central1-c"%0A      + managed_instance_group_urls = (known after apply)%0A      + max_pods_per_node           = (known after apply)%0A      + name                        = "cluster-1-node-pool"%0A      + name_prefix                 = (known after apply)%0A      + node_count                  = 1%0A      + node_locations              = (known after apply)%0A      + operation                   = (known after apply)%0A      + project                     = (known after apply)%0A      + version                     = (known after apply)%0A%0A      + node_config {%0A          + disk_size_gb      = (known after apply)%0A          + disk_type         = (known after apply)%0A          + guest_accelerator = (known after apply)%0A          + image_type        = (known after apply)%0A          + labels            = (known after apply)%0A          + local_ssd_count   = (known after apply)%0A          + logging_variant   = "DEFAULT"%0A          + machine_type      = "n1-standard-2"%0A          + metadata          = (known after apply)%0A          + min_cpu_platform  = (known after apply)%0A          + oauth_scopes      = [%0A              + "https://www.googleapis.com/auth/cloud-platform",%0A            ]%0A          + preemptible       = true%0A          + service_account   = "k8s-sa@istiosetup.iam.gserviceaccount.com"%0A          + spot              = false%0A          + taint             = (known after apply)%0A        }%0A    }%0A%0A  # module.cluster-2.google_container_cluster.primary will be created%0A  + resource "google_container_cluster" "primary" {%0A      + cluster_ipv4_cidr           = (known after apply)%0A      + datapath_provider           = (known after apply)%0A      + default_max_pods_per_node   = (known after apply)%0A      + enable_binary_authorization = false%0A      + enable_intranode_visibility = (known after apply)%0A      + enable_kubernetes_alpha     = false%0A      + enable_l4_ilb_subsetting    = false%0A      + enable_legacy_abac          = false%0A      + enable_shielded_nodes       = true%0A      + endpoint                    = (known after apply)%0A      + id                          = (known after apply)%0A      + initial_node_count          = 1%0A      + label_fingerprint           = (known after apply)%0A      + location                    = "us-east1-b"%0A      + logging_service             = (known after apply)%0A      + master_version              = (known after apply)%0A      + monitoring_service          = (known after apply)%0A      + name                        = "cluster-2"%0A      + network                     = "default"%0A      + networking_mode             = (known after apply)%0A      + node_locations              = (known after apply)%0A      + node_version                = (known after apply)%0A      + operation                   = (known after apply)%0A      + private_ipv6_google_access  = (known after apply)%0A      + project                     = "istiosetup"%0A      + remove_default_node_pool    = true%0A      + self_link                   = (known after apply)%0A      + services_ipv4_cidr          = (known after apply)%0A      + subnetwork                  = (known after apply)%0A      + tpu_ipv4_cidr_block         = (known after apply)%0A%0A      + workload_identity_config {%0A          + workload_pool = "istiosetup.svc.id.goog"%0A        }%0A    }%0A%0A  # module.cluster-2-node-pool.google_container_node_pool.primary_preemptible_nodes will be created%0A  + resource "google_container_node_pool" "primary_preemptible_nodes" {%0A      + cluster                     = "cluster-2"%0A      + id                          = (known after apply)%0A      + initial_node_count          = (known after apply)%0A      + instance_group_urls         = (known after apply)%0A      + location                    = "us-east1-b"%0A      + managed_instance_group_urls = (known after apply)%0A      + max_pods_per_node           = (known after apply)%0A      + name                        = "cluster-2-node-pool"%0A      + name_prefix                 = (known after apply)%0A      + node_count                  = 1%0A      + node_locations              = (known after apply)%0A      + operation                   = (known after apply)%0A      + project                     = (known after apply)%0A      + version                     = (known after apply)%0A%0A      + node_config {%0A          + disk_size_gb      = (known after apply)%0A          + disk_type         = (known after apply)%0A          + guest_accelerator = (known after apply)%0A          + image_type        = (known after apply)%0A          + labels            = (known after apply)%0A          + local_ssd_count   = (known after apply)%0A          + logging_variant   = "DEFAULT"%0A          + machine_type      = "n1-standard-2"%0A          + metadata          = (known after apply)%0A          + min_cpu_platform  = (known after apply)%0A          + oauth_scopes      = [%0A              + "https://www.googleapis.com/auth/cloud-platform",%0A            ]%0A          + preemptible       = true%0A          + service_account   = "k8s-sa@istiosetup.iam.gserviceaccount.com"%0A          + spot              = false%0A          + taint             = (known after apply)%0A        }%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0
stdout<<ghadelimiter_3be1bc33-cf69-42dc-8dbe-5690ae51b6da

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster-1.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "us-central1-c"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "cluster-1"
      + network                     = "default"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "istiosetup"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + workload_identity_config {
          + workload_pool = "istiosetup.svc.id.goog"
        }
    }

  # module.cluster-1-node-pool.google_container_node_pool.primary_preemptible_nodes will be created
  + resource "google_container_node_pool" "primary_preemptible_nodes" {
      + cluster                     = "cluster-1"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1-c"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "cluster-1-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n1-standard-2"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "k8s-sa@istiosetup.iam.gserviceaccount.com"
          + spot              = false
          + taint             = (known after apply)
        }
    }

  # module.cluster-2.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "us-east1-b"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "cluster-2"
      + network                     = "default"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "istiosetup"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + workload_identity_config {
          + workload_pool = "istiosetup.svc.id.goog"
        }
    }

  # module.cluster-2-node-pool.google_container_node_pool.primary_preemptible_nodes will be created
  + resource "google_container_node_pool" "primary_preemptible_nodes" {
      + cluster                     = "cluster-2"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1-b"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "cluster-2-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n1-standard-2"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "k8s-sa@istiosetup.iam.gserviceaccount.com"
          + spot              = false
          + taint             = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

ghadelimiter_3be1bc33-cf69-42dc-8dbe-5690ae51b6da
stderr<<ghadelimiter_afaadf60-0a83-44fa-aa57-a89964308351

ghadelimiter_afaadf60-0a83-44fa-aa57-a89964308351
exitcode<<ghadelimiter_bd7077e3-f10f-47dd-8dd0-54afcb2bc065
0
ghadelimiter_bd7077e3-f10f-47dd-8dd0-54afcb2bc065
```

Plan saved to GH artifacts.